# Housing Market

### Introduction:

This time we will create our own dataset with fictional numbers to describe a house market. As we are going to create random data don't try to reason of the numbers.

### Step 1. Import the necessary libraries

In [2]:
import pandas as pd
import numpy as np

class display(object):
    """Display HTML representation of multiple objects"""
    template = """<div style="float: left; padding: 10px;">
    <p style='font-family:"Courier New", Courier, monospace'>{0}</p>{1}
    </div>"""
    def __init__(self, *args):
        self.args = args
        
    def _repr_html_(self):
        return '\n'.join(self.template.format(a, eval(a)._repr_html_())
                         for a in self.args)
    
    def __repr__(self):
        return '\n\n'.join(a + '\n' + repr(eval(a))
                           for a in self.args)

### Step 2. Create 3 differents Series, each of length 100, as follows: 
1. The first a random number from 1 to 4 
2. The second a random number from 1 to 3
3. The third a random number from 10,000 to 30,000

In [9]:
np.random.seed(0)

size = 100

sr1 = pd.Series(np.random.randint(1, 5, size=size))
sr2 = pd.Series(np.random.randint(1, 4, size=size))
sr3 = pd.Series(np.random.randint(1e4, 30001, size=size))

sr3

0     15021
1     11134
2     26409
3     19680
4     27340
      ...
95    28161
96    29745
97    18338
98    24676
99    12562
Length: 100, dtype: int32

### Step 3. Let's create a DataFrame by joinning the Series by column

In [10]:
df = pd.concat([sr1, sr2, sr3], axis=1)
df

    0  1      2
0   1  2  15021
1   4  3  11134
2   2  1  26409
3   1  1  19680
4   4  3  27340
.. .. ..    ...
95  1  2  28161
96  3  2  29745
97  4  1  18338
98  2  1  24676
99  1  1  12562

[100 rows x 3 columns]

In [16]:
pd.DataFrame([sr1, sr2, sr3]).T

    0  1      2
0   1  2  15021
1   4  3  11134
2   2  1  26409
3   1  1  19680
4   4  3  27340
.. .. ..    ...
95  1  2  28161
96  3  2  29745
97  4  1  18338
98  2  1  24676
99  1  1  12562

[100 rows x 3 columns]

### Step 4. Change the name of the columns to bedrs, bathrs, price_sqr_meter

In [21]:
cols = ["bedrs", "bathrs", "price_sqr_meter"]
print(cols)

['bedrs', 'bathrs', 'price_sqr_meter']

In [22]:
df_cp = df.copy()
df_cp.columns = cols
df_cp

    bedrs  bathrs  price_sqr_meter
0       1       2            15021
1       4       3            11134
2       2       1            26409
3       1       1            19680
4       4       3            27340
..    ...     ...              ...
95      1       2            28161
96      3       2            29745
97      4       1            18338
98      2       1            24676
99      1       1            12562

[100 rows x 3 columns]

In [25]:
pd.DataFrame({cols[0]:sr1, cols[1]:sr2, cols[2]:sr3})

    bedrs  bathrs  price_sqr_meter
0       1       2            15021
1       4       3            11134
2       2       1            26409
3       1       1            19680
4       4       3            27340
..    ...     ...              ...
95      1       2            28161
96      3       2            29745
97      4       1            18338
98      2       1            24676
99      1       1            12562

[100 rows x 3 columns]

### Step 5. Create a column DataFrame with the values of the 3 Series and assign it to 'bigcolumn'

In [37]:
df_bc = pd.concat([sr1, sr2, sr3], axis=0)
df_bc

0         1
1         4
2         2
3         1
4         4
      ...
95    28161
96    29745
97    18338
98    24676
99    12562
Length: 300, dtype: int32

### Step 6. Oops, it seems it is going only until index 99. Is it true?

In [38]:
print(len(df_bc.index), max(df_bc.index))

300 99

### Step 7. Reindex the DataFrame so it goes from 0 to 299

In [39]:
df_bc = df_bc.reset_index(drop=True)

In [40]:
print(len(df_bc.index), max(df_bc.index))

300 299